HELYXcore-4.4.0/examples/legacy/heatTransfer/buoyantSimpleFoam/circuitBoardCooling/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    floor
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }
    ceiling
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }
    inlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 101325;
    }
    fixedWalls
    {
        type            empty;
    }

}


// ************************************************************************* //
