HELYXcore-4.4.0/examples/legacy/heatTransfer/buoyantSimpleFoam/circuitBoardCooling/system/baffle3DRegion/materialProperties

/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

materialType     solid;
kappaModel       constSolid;
thermodynamics   hConst;
equationOfState  rhoConst;
energy           sensibleEnthalpy;


molWeight       20;
kappaModelCoeffs
{
    kappa           1;
}
thermodynamicsCoeffs
{
    Hf              0;
    Cp              10;
}
equationOfStateCoeffs
{
    rho             10;
}

// ************************************************************************* //