HELYXcore-4.4.0/examples/legacy/heatTransfer/buoyantSimpleFoam/circuitBoardCooling/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

restore0Dir

# Create 1D and 3D baffles
runApplication createBaffles -overwrite

runApplication $(getApplication)

#------------------------------------------------------------------------------
